In [1]:
import cx_Oracle as oracle;

In [5]:
conn=oracle.connect("scott/Abbas_2004@localhost:1521/ORCL");

In [6]:
print(conn.version)

11.2.0.1.0

In [7]:
cursor=conn.cursor();

In [8]:
cursor.execute("SELECT * FROM emp");

In [9]:
rows=cursor.fetchall();

In [10]:
print(rows);

[(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20), (7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30), (7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30), (7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20), (7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30), (7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850.0, None, 30), (7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10), (7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1987, 4, 19, 0, 0), 3000.0, None, 20), (7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10), (7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500.0, 0.0, 30), (7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1987, 5, 23, 0, 0), 1100.0, None, 20), (7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950.0, None, 30), (7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20), (7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10)]

In [12]:
rows=cursor.description;

In [13]:
print(rows)

[('EMPNO', <cx_Oracle.DbType DB_TYPE_NUMBER>, 5, None, 4, 0, 0), ('ENAME', <cx_Oracle.DbType DB_TYPE_VARCHAR>, 10, 40, None, None, 1), ('JOB', <cx_Oracle.DbType DB_TYPE_VARCHAR>, 9, 36, None, None, 1), ('MGR', <cx_Oracle.DbType DB_TYPE_NUMBER>, 5, None, 4, 0, 1), ('HIREDATE', <cx_Oracle.DbType DB_TYPE_DATE>, 23, None, None, None, 1), ('SAL', <cx_Oracle.DbType DB_TYPE_NUMBER>, 11, None, 7, 2, 1), ('COMM', <cx_Oracle.DbType DB_TYPE_NUMBER>, 11, None, 7, 2, 1), ('DEPTNO', <cx_Oracle.DbType DB_TYPE_NUMBER>, 3, None, 2, 0, 1)]

#### GPT

In [21]:
cursor=cursor.execute("select * from emp");

In [22]:
# Fetch all rows as a list of dictionaries
columns = [col[0] for col in cursor.description]
result = [dict(zip(columns, row)) for row in cursor.fetchall()]

# Print the formatted result
for row in result:
    print(row);

{'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': datetime.datetime(1980, 12, 17, 0, 0), 'SAL': 800.0, 'COMM': None, 'DEPTNO': 20}
{'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 2, 20, 0, 0), 'SAL': 1600.0, 'COMM': 300.0, 'DEPTNO': 30}
{'EMPNO': 7521, 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 2, 22, 0, 0), 'SAL': 1250.0, 'COMM': 500.0, 'DEPTNO': 30}
{'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': datetime.datetime(1981, 4, 2, 0, 0), 'SAL': 2975.0, 'COMM': None, 'DEPTNO': 20}
{'EMPNO': 7654, 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 9, 28, 0, 0), 'SAL': 1250.0, 'COMM': 1400.0, 'DEPTNO': 30}
{'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': datetime.datetime(1981, 5, 1, 0, 0), 'SAL': 2850.0, 'COMM': None, 'DEPTNO': 30}
{'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': datetime.datetime(1981, 6, 9, 0, 0), 'SAL': 2450.0, 'COMM': None, 'DEPTNO': 10}
{'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': datetime.datetime(1987, 4, 19, 0, 0), 'SAL': 3000.0, 'COMM': None, 'DEPTNO': 20}
{'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'MGR': None, 'HIREDATE': datetime.datetime(1981, 11, 17, 0, 0), 'SAL': 5000.0, 'COMM': None, 'DEPTNO': 10}
{'EMPNO': 7844, 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 9, 8, 0, 0), 'SAL': 1500.0, 'COMM': 0.0, 'DEPTNO': 30}
{'EMPNO': 7876, 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': 7788, 'HIREDATE': datetime.datetime(1987, 5, 23, 0, 0), 'SAL': 1100.0, 'COMM': None, 'DEPTNO': 20}
{'EMPNO': 7900, 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 12, 3, 0, 0), 'SAL': 950.0, 'COMM': None, 'DEPTNO': 30}
{'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': datetime.datetime(1981, 12, 3, 0, 0), 'SAL': 3000.0, 'COMM': None, 'DEPTNO': 20}
{'EMPNO': 7934, 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': 7782, 'HIREDATE': datetime.datetime(1982, 1, 23, 0, 0), 'SAL': 1300.0, 'COMM': None, 'DEPTNO': 10}

In [23]:
print(result);

[{'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': datetime.datetime(1980, 12, 17, 0, 0), 'SAL': 800.0, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 2, 20, 0, 0), 'SAL': 1600.0, 'COMM': 300.0, 'DEPTNO': 30}, {'EMPNO': 7521, 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 2, 22, 0, 0), 'SAL': 1250.0, 'COMM': 500.0, 'DEPTNO': 30}, {'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': datetime.datetime(1981, 4, 2, 0, 0), 'SAL': 2975.0, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 7654, 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 9, 28, 0, 0), 'SAL': 1250.0, 'COMM': 1400.0, 'DEPTNO': 30}, {'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': datetime.datetime(1981, 5, 1, 0, 0), 'SAL': 2850.0, 'COMM': None, 'DEPTNO': 30}, {'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': datetime.datetime(1981, 6, 9, 0, 0), 'SAL': 2450.0, 'COMM': None, 'DEPTNO': 10}, {'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': datetime.datetime(1987, 4, 19, 0, 0), 'SAL': 3000.0, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'MGR': None, 'HIREDATE': datetime.datetime(1981, 11, 17, 0, 0), 'SAL': 5000.0, 'COMM': None, 'DEPTNO': 10}, {'EMPNO': 7844, 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 9, 8, 0, 0), 'SAL': 1500.0, 'COMM': 0.0, 'DEPTNO': 30}, {'EMPNO': 7876, 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': 7788, 'HIREDATE': datetime.datetime(1987, 5, 23, 0, 0), 'SAL': 1100.0, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 7900, 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': 7698, 'HIREDATE': datetime.datetime(1981, 12, 3, 0, 0), 'SAL': 950.0, 'COMM': None, 'DEPTNO': 30}, {'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': datetime.datetime(1981, 12, 3, 0, 0), 'SAL': 3000.0, 'COMM': None, 'DEPTNO': 20}, {'EMPNO': 7934, 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': 7782, 'HIREDATE': datetime.datetime(1982, 1, 23, 0, 0), 'SAL': 1300.0, 'COMM': None, 'DEPTNO': 10}]

In [19]:
print(columns);

['EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO']

In [58]:
cursor.execute("select * from dept");

In [59]:
print(cursor.description);

[('DEPTNO', <cx_Oracle.DbType DB_TYPE_NUMBER>, 3, None, 2, 0, 0), ('DNAME', <cx_Oracle.DbType DB_TYPE_VARCHAR>, 14, 56, None, None, 1), ('LOC', <cx_Oracle.DbType DB_TYPE_VARCHAR>, 13, 52, None, None, 1)]

In [60]:
print(cursor.fetchall());

[(10, 'ACCOUNTING', 'NEW YORK'), (20, 'RESEARCH', 'DALLAS'), (30, 'SALES', 'CHICAGO'), (40, 'OPERATIONS', 'BOSTON')]

In [61]:
columns=[col[0] for col in cursor.description]

In [62]:
print(columns)

['DEPTNO', 'DNAME', 'LOC']

In [65]:
cursor.execute("select * from dept");

In [66]:
result=[dict(zip(columns,row)) for row in cursor.fetchall()];

In [67]:
print(result);

[{'DEPTNO': 10, 'DNAME': 'ACCOUNTING', 'LOC': 'NEW YORK'}, {'DEPTNO': 20, 'DNAME': 'RESEARCH', 'LOC': 'DALLAS'}, {'DEPTNO': 30, 'DNAME': 'SALES', 'LOC': 'CHICAGO'}, {'DEPTNO': 40, 'DNAME': 'OPERATIONS', 'LOC': 'BOSTON'}]

In [71]:
a=('deptno','dname','loc');
b=(10,'accounting','new york');
c=dict(zip(a,b));
print(c);

{'deptno': 10, 'dname': 'accounting', 'loc': 'new york'}